import { Container, Stack, Typography } from "@mui/material"
import React from "react"
import Footer from "../../Home/MainHome/Footer"

const Policy = () => {
	return (
		<>
			<Container>
				<Stack spacing={2}>
					<Stack spacing={1}>
						<Typography variant="h5">Политика конфиденциальности</Typography>
						<Typography variant="h6">1. ОБЩИЕ ПОЛОЖЕНИЯ</Typography>

						<Stack spacing={1} pl={2}>
							<Typography>
								1. Настоящая Политика конфиденциальности устанавливает правила
								работы с информацией, получаемой от посетителей и пользователей
								сайта AvtoLike.kz.
							</Typography>

							<Typography>
								2. Обработка персональных данных и иной информации в случае ее
								получения от пользователей сайта AvtoLike.kz осуществляется в
								соответствии с Законом Республики Казахстан от 21 мая 2013 года
								№ 94-V «О персональных данных и их защите», Закон Республики
								Казахстан от 24 ноября 2015 года № 418-V «Об информатизации»,
								иными нормативными правовыми актами Республики Казахстан.
							</Typography>
							<Typography>
								3. Все термины и определения, используемые в тексте настоящего
								документа, подлежат толкованию в соответствии с действующим
								законодательством Республики Казахстан.
							</Typography>
							<Typography>
								1. Посетителем или пользователем сайта AvtoLike.kz является
								любое лицо, осуществившее вход на сайт для его просмотра и
								получения информации, размещенной в свободном доступе, либо с
								иной целью ознакомительного характера.
							</Typography>
							<Typography>
								2. Зарегистрированным пользователем (далее – пользователь или
								зарегистрированный пользователь) сайта AvtoLike.kz является
								лицо, осуществившее вход на сайт для его просмотра, получения
								информации, консультации и услуг, а также:
							</Typography>

							<Typography>
								▪ зарегистрировавшееся на сайте для получения доступа (логин и
								пароль) в личный кабинет. Активация личного кабинета
								осуществляется после подтверждения (проверки) адреса электронной
								почты и/или контактного номера телефона пользователя путем
								принятия пользователем направленной ему электронной ссылки либо
								СМС-сообщения;
							</Typography>

							<Typography>
								▪ или предоставившее по телефону через оператора сайта
								AvtoLike.kz данные, необходимые для взаимодействия с сервисами
								сайта.
							</Typography>
							<Typography>
								Регистрация на сайте одновременно означает согласие (акцепт) с
								условиями пользовательского соглашения (оферты).{" "}
							</Typography>
							<Typography>
								4. Использование сайта AvtoLike.kz, означает выражение
								безоговорочного согласия с Политикой конфиденциальности.
								Посетители и пользователи прямо соглашаются на обработку
								информации, поступающей в связи с пользованием сайтом, в порядке
								и на условиях, указанных в настоящей Политике.
							</Typography>
							<Typography>
								5. Посетитель или пользователь должен прекратить пользование
								сайтом AvtoLike.kz, если он не согласен с условиями настоящей
								Политики конфиденциальности.
							</Typography>
						</Stack>
					</Stack>

					<Stack spacing={1}>
						<Typography variant="h6">
							2. ИНФОРМАЦИЯ, ОБРАБАТЫВАЕМАЯ В СВЯЗИ С ПОЛЬЗОВАНИЕМ САЙТОМ
						</Typography>
						<Stack spacing={1} pl={2}>
							<Typography>
								1. В связи с пользованием сайтом AvtoLike.kz, Администрация
								сайта получает данные посетителей и пользователей, включая
								техническую и другую информацию.
							</Typography>
							<Typography>
								2. Техническая информация не относится к персональным данным.
								Технической информацией является информация, автоматически
								поступающая в процессе использования сайта при помощи
								программного обеспечения, установленного на устройствах
								(гаджетах) лица, посетившего сайт, и обеспечивающего доступ к
								сайту. Сайт AvtoLike.kz использует файлы cookies, которые
								позволяют технически идентифицировать канал входа на сайт и его
								индивидуальные предпочтения. Файлы cookies – это текстовые
								файлы, которые становятся доступны сайту AvtoLike.kz для
								обработки информации об активности лица, посетившего сайт,
								включая информацию о страницах посещения и о времени,
								проведенном на странице. Лицо, посетившее сайт, может отключить
								возможность использования файлов cookies в настройках браузера.
								К иной технической информации могут относиться сведения об
								используемом браузере (или иной программе, с помощью которой
								осуществляется доступ к сайту), его IP адрес и иное.
							</Typography>
							<Typography>
								3. Персональными данными является любая информация, лично (прямо
								или косвенно) относящаяся к физическому лицу как субъекту
								персональных данных в терминологии законодательства Республики
								Казахстан о персональных данных. Особенности сбора, обработки и
								защиты персональной информации, предоставляемой
								зарегистрированным пользователем в случае заказа, получения и
								оплаты услуг сайта AvtoLike.kz, регулируется пользовательским
								соглашением и статьей 6 настоящей Политики конфиденциальности.
							</Typography>
							<Typography>
								4. Администрация/Владельцы сайта AvtoLike.kz может получать от
								посетителей и пользователей, подписавшихся на получение
								новостных рассылок, или к иным сервисам сайта, обезличенные
								данные, содержащие номер телефона и/или адрес электронной почты.
								В этом случае предоставленные данные используются исключительно
								для направления по указанным реквизитам новостей сайта
								AvtoLike.kz и иных сообщений информационного и рекламного
								характера.{" "}
							</Typography>
							<Typography>
								5. Администрация сайта AvtoLike.kz не проверяет достоверность и
								актуальность информации, предоставленной пользователем, и не
								оценивает его дееспособность. При этом Администрация сайта
								исходит из того, что лицо, предоставившее информацию, действует
								добросовестно и разумно, по своей воле и в своем интересе.
								Администрация сайта также может обрабатывать данные, сделанные
								субъектом персональных данных общедоступными либо подлежащие
								опубликованию или обязательному раскрытию в соответствии с
								законодательством Республики Казахстан.
							</Typography>
							<Typography>
								6. В случае обнаружения неточности предоставленных данных их
								актуализация осуществляется Администрацией сайта AvtoLike.kz, по
								обращению заинтересованного лица.{" "}
							</Typography>
						</Stack>
					</Stack>

					<Stack spacing={1}>
						<Typography variant="h6">
							3. ЦЕЛИ ОБРАБОТКИ ПРЕДОСТАВЛЕННОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
						</Typography>

						<Stack spacing={1} pl={2}>
							<Typography>
								Обработка данных, получаемых Администрацией сайта AvtoLike.kz,
								осуществляется с целью:{" "}
							</Typography>
							<Typography>
								1. уведомления о новостях, акциях и предложениях сайта,
								получения пользователями рекламной, справочной и иной информации
								о деятельности сайта AvtoLike.kz;
							</Typography>
							<Typography>
								2. улучшения качества услуг, развития сайта AvtoLike.kz;
							</Typography>
							<Typography>
								3. проведения опросов, анкетирования, иных статистических и иных
								исследований на основе обезличенных данных;
							</Typography>
							<Typography>
								4. заключения и исполнения гражданско-правового договора на
								оказание услуг сайта AvtoLike.kz (пользовательское соглашение),
								с учетом особенностей, указанных в статье 6 настоящей Политики
								конфиденциальности.{" "}
							</Typography>
						</Stack>
					</Stack>

					<Stack spacing={1}>
						<Typography variant="h6">
							4. УСЛОВИЯ И СПОСОБЫ ОБРАБОТКИ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЁ
							ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ
						</Typography>

						<Stack spacing={1} pl={2}>
							<Typography>
								1. В отношении данных, предоставленных пользователем,
								сохраняется ее конфиденциальность, кроме случаев добровольного
								предоставления пользователем информации о себе для общего
								доступа неограниченному кругу лиц.
							</Typography>
							<Typography>
								2. Администрация сайта AvtoLike.kz не осуществляет передачу
								персональных и иных данных пользователя третьим лицам, за
								исключением случаев, когда пользователь выразил согласие на
								такие действия. Пользователь соглашается на передачу данных
								третьим лицам в случаях, когда:
							</Typography>
							<Typography>
								1. передача необходима для использования пользователем
								определенной услуги сайта AvtoLike.kz либо для исполнения
								договора или соглашения с пользователем;
							</Typography>
							<Typography>
								2. передача уполномоченным органам государственной власти
								Республики Казахстан должна быть осуществлена по основаниям и в
								порядке, установленным законодательством Республики Казахстан;
							</Typography>
							<Typography>
								3. пользователь нарушает условия и требования, установленные
								настоящей Политикой, в целях обеспечения возможности защиты прав
								и законных интересов сайта AvtoLike.kz или третьих лиц;
							</Typography>
							<Typography>
								4. в результате обобщения информации пользователей получены
								обезличенные статистические данные, которые передаются третьему
								лицу для проведения маркетинговых и иных исследований в
								интересах сайта AvtoLike.kz, улучшения качества работы и
								оказания услуг.
							</Typography>

							<Typography>
								Администрация сайта AvtoLike.kz не уведомляет пользователя о
								передаче данных третьим лицам во всех указанных случаях.
								Обработка данных пользователей сайта AvtoLike.kz преимущественно
								осуществляется с использованием средств автоматизации.{" "}
							</Typography>
						</Stack>
					</Stack>
					<Stack spacing={1}>
						<Typography variant="h6">
							5. МЕРЫ, ПРИМЕНЯЕМЫЕ ДЛЯ ЗАЩИТЫ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ
							ПОЛЬЗОВАТЕЛЯ
						</Typography>
						<Stack spacing={1} pl={2}>
							<Typography>
								o Администрация сайта AvtoLike.kz принимает необходимые и
								достаточные меры для обеспечения защиты полученной информации от
								неправомерных действий третьих лиц.
							</Typography>
							<Typography>
								o Пользователь сайта AvtoLike.kz вправе в любое время
								потребовать уничтожения предоставленных данных, направив
								уведомление об этом на адрес электронной почты
								subscribe@аvtoLike.kz В этом случае Администрация сайта обязана
								исключить предоставленные данные из своей базы данных в
								кратчайшие сроки, допустимые техническими возможностями, за
								исключением случаев, установленных действующим законодательством
								Республики Казахстан и являющихся основанием для продолжения
								обработки данных.
							</Typography>
							<Typography>
								o Техническая защита полученных данных осуществляется с целью
								обеспечения их конфиденциальности. Безопасность данных
								обеспечивается с помощью системы защиты информации, включающей
								такие меры, как определение угроз безопасности, использование
								технических средств защиты от несанкционированного
								вмешательства, применение прошедших в установленном порядке
								процедуру оценки соответствия средств защиты информации,
								обнаружение и блокирование несанкционированного доступа,
								контроль за уровнем защищенности информационных систем и баз
								данных. В целях обеспечения соответствия уровня защиты данных
								требованиям законодательства Республики Казахстан о защите
								информации конкретные применяемые средства и меры обеспечения
								информационной безопасности не раскрываются.
							</Typography>
						</Stack>
					</Stack>
					<Stack spacing={1}>
						<Typography variant="h6">
							6. ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ, В ТОМ ЧИСЛЕ ПРИ ЗАКЛЮЧЕНИИ
							ДОГОВОРА НА ОКАЗАНИЕ УСЛУГ (ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ)
						</Typography>
						<Stack spacing={1} pl={2}>
							<Typography>
								1. Персональные данные – любая информация, относящаяся к прямо
								или косвенно определенному или определяемому физическому лицу
								(субъекту персональных данных); Обработка персональных данных –
								любое действие (операция) или совокупность действий (операций),
								совершаемых с персональными данными, включая сбор, запись,
								систематизацию, накопление, хранение, уточнение (обновление,
								изменение), извлечение, использование, передачу
								(распространение, предоставление, доступ), обезличивание,
								блокирование, удаление, уничтожение персональных данных.
							</Typography>
							<Typography>
								2. Персональные данные зарегистрированных пользователей,
								предоставленные для взаимодействия с сервисами сайта
								AvtoLike.kz, заказа, получения, оплаты услуг сайта AvtoLike.kz,
								в том числе в рамках заключения и исполнения
								гражданско-правового договора об оказании услуг
								(пользовательского соглашения), обрабатываются исполнителем
								услуг, а именно: Товариществом с ограниченной ответственностью
								«AvtoLike», именуемым как Администрация или Владелец сайта.
								Обработка персональных данных осуществляется в порядке,
								установленном пользовательским соглашением и положениями
								настоящей Политики конфиденциальности. Администрация сайта
								AvtoLike.kz организует обработку персональных данных
								зарегистрированных пользователей, определяет цели обработки
								персональных данных и действия (операции), совершаемые с
								персональными данными.
							</Typography>
							<Typography>
								3. Обработка персональных данных, получаемых Администрацией
								сайта AvtoLike.kz, осуществляется в объеме, необходимом для
								взаимодействия пользователя с сервисами сайта и/или заключения и
								исполнения соответствующего договора на оказание услуг
								(пользовательского соглашения). Соглашаясь с условиями
								пользовательского соглашения, зарегистрированный пользователь
								одновременное дает свое согласие на обработку персональных
								данных в соответствии с настоящей Политикой конфиденциальности.
							</Typography>
							<Typography>
								4. Персональные данные зарегистрированного пользователя
								относятся к конфиденциальной информации ограниченного доступа.
								Администрация сайта AvtoLike.kz не передает, не раскрывает, не
								распространяет персональные данные без согласия
								зарегистрированного пользователя, если иное не предусмотрено
								законодательством Республики Казахстан. Обеспечения
								конфиденциальности персональных данных не требуется в случае их
								обезличивания, а также в отношении общедоступных персональных
								данных и случаев добровольного предоставления пользователем
								информации о себе для общего доступа неограниченного круга лиц.
							</Typography>
							<Typography>
								5. Обработка персональных данных осуществляется на основе
								следующих принципов:
							</Typography>
							<Typography>
								1. обработка персональных данных ограничивается достижением
								конкретных, заранее определенных целей обработки;
							</Typography>
							<Typography>
								2. обработке подлежат только те персональные данные, которые
								отвечают целям их обработки;
							</Typography>
							<Typography>
								3. содержание и объем обрабатываемых персональных данных должны
								соответствовать целям обработки. Персональные данные, являющиеся
								избыточными по отношению к целям обработки, не обрабатываются;
							</Typography>
							<Typography>
								4. хранение персональных данных осуществляется в течение срока,
								необходимого для достижения целей обработки. Персональные данные
								подлежат уничтожению или обезличиванию по достижении целей
								обработки либо утраты необходимости в достижении этих целей,
								если иное не установлено действующим законодательством
								Республики Казахстан;
							</Typography>
							<Typography>
								5. обработка персональных данных осуществляется на законных
								основаниях с соблюдением иных принципов и требований,
								установленных законодательством Республики Казахстан о защите
								персональных данных.
							</Typography>
							<Typography>
								6. Обработка персональных данных зарегистрированных
								пользователей сайта AvtoLike.kz осуществляется исключительно в
								целях:
							</Typography>
							<Typography>
								1. предоставления зарегистрированному пользователю возможности
								получения консультационных услуг сайта,
							</Typography>
							<Typography>
								2. заключения и исполнения договора на оказание услуг
								(пользовательского соглашения),
							</Typography>
							<Typography>
								3. взаимодействия зарегистрированного пользователя с
								Администрацией сайта как исполнителем услуг по договору на
								оказание услуг (пользовательское соглашение).
							</Typography>
							<Typography>
								Обработка персональной информации допускается в иных случаях,
								установленных Законом Республики Казахстан от 21 мая 2013 года №
								94-V «О персональных данных и их защите».
							</Typography>
							<Typography>
								7. Источником информации обо всех персональных данных
								зарегистрированного пользователя является непосредственно сам
								пользователь. Для взаимодействия с сервисами сайта AvtoLike.kz,
								а также для заключения и исполнения гражданско-правового
								договора на оказание услуг (пользовательское соглашение)
								зарегистрированный пользователь предоставляет следующие данные:
								фамилия, имя, отчество, адрес электронной почты и номер
								телефона.
							</Typography>
							<Typography>
								8. Согласие пользователя сайта AvtoLike.kz на обработку
								персональных данных в соответствии с настоящей Политикой
								конфиденциальности действует до отмены цели обработки, отзыва
								согласия пользователем, а также до наступления иных
								обстоятельств, предусмотренных действующим законодательством
								Республики Казахстан. В случае достижения целей обработки
								персональных данных (удаления аккаунта или личного кабинета
								зарегистрированного пользователя с сайта AvtoLike.kz
							</Typography>
							<Typography>
								9. Требования о защите персональных данных обеспечиваются
								мерами, принимаемыми Администрацией сайта AvtoLike.kz, в том
								числе: назначением лиц, уполномоченных на работу с персональными
								данными, условиями хранения персональных данных и доступа к ним,
								технической защитой, внутренним контролем (аудитом), внутренними
								регулирующими локальными актами и пр.
							</Typography>
							<Typography>
								10. Обработка персональных данных пользователей осуществляется
								ответственными лицами, допущенными к работе с персональными
								данными в соответствии с внутренними документами Администрации
								сайта. Иные лица не вправе обрабатывать персональные данные
								пользователей. Выполнение данного условия обеспечивается
								дисциплинарными и иными мерами, применяемыми Администрацией
								сайта.
							</Typography>
							<Typography>
								11. Обработка персональных данных преимущественно осуществляется
								с использованием средств автоматизации. Обработка персональных
								данных на бумажном носителе осуществляется только в случае
								необходимости ведения бумажного документооборота при заключении
								и исполнении гражданско-правового договора на оказание услуг.
							</Typography>
						</Stack>
					</Stack>

					<Stack spacing={1}>
						<Typography variant="h6">7. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</Typography>
						<Stack spacing={1} pl={2}>
							<Typography>
								12. Администрация сайта AvtoLike.kz вправе вносить изменения в
								настоящую Политику конфиденциальности без согласия пользователя.
								Продолжение использования сайта после внесения таких изменений
								подтверждает согласие пользователя с такими изменениями.
							</Typography>
							<Typography>
								13. Настоящая Политика размещается на сайте AvtoLike.kz, в
								месте, доступном для посетителей и пользователей.
							</Typography>
						</Stack>
					</Stack>
				</Stack>
			</Container>
			<Stack pt={5}>
				<Footer />
			</Stack>
		</>
	)
}

export default Policy
