import { Container, Stack, Typography } from "@mui/material"
import React from "react"

const Policy = () => {
	return (
		<Container>
			<Stack spacing={1}>
				<Typography variant="h6">Политика конфиденциальности</Typography>
				<Typography>
					Мобильное приложение «AvtoLike — цены на машины», и предоставляет
					возможность взаимодействовать с Базой данных продажи транспортных
					средств, а также предоставляет услуги, включая общение на форумах,
					пользование новостными, справочными и информационными услугами, но не
					ограничиваясь ими. При использовании портала Вы соглашаетесь выполнять
					все условия и ограничения, как указано в настоящих Правилах где бы то
					ни было в наших службах, а при регистрации - принимаете на себя
					указанные в них права и обязанности.
				</Typography>

				<Typography>
					AvtoLike имеет право не заключать или расторгнуть договор с любым
					пользователем без объяснения причин.
				</Typography>

				<Typography>
					1. Размещая информацию на портале AvtoLike, пользователь передаёт
					исключительные права на данную информацию AvtoLike. AvtoLike не несет
					никаких обязательств по обеспечению конфиденциальности в отношении
					этой информации, если не имеется договоренности об обратном или
					соответствующих требований действующего законодательства.
				</Typography>
				<Typography>
					2. Вся информация, размещенная на портале AvtoLike, включая базу
					данных, тексты, фото- и видеоизображения, дизайн, подбор, группировку
					и расположение материалов, является интеллектуальной собственностью
					AvtoLike и защищается нормами гражданского, административного и
					уголовного законодательства Российской Федерации, а также нормами
					международного права по охране интеллектуальной собственности.
				</Typography>
				<Typography>
					3. Информация портала AvtoLike предназначена исключительно для
					персонального и некоммерческого использования. Воспроизведение и
					использование информации с сайта разрешено только с письменного
					разрешения AvtoLike, которое можно получить, обратившись с официальным
					письмом в центральный офис компании. Копирование информации,
					содержащейся на данном сайте, может осуществляться только физическими
					лицами для личного пользования.
				</Typography>
				<Typography>
					5. Запрещается использование автоматизированного извлечения информации
					данного портала и/или из «Базы данных продажи транспортных средств на
					портале AvtoLike.kz» без письменного разрешения AvtoLike.
				</Typography>
				<Typography>
					6. Любое извлечение, сбор, переработка, копирование, перепечатка и/или
					последующее распространение информации, представленной на данном
					портале и/или из «Базы данных продажи транспортных средств на портале
					AvtoLike.kz» или любой иной информации, полученной в результате
					переработки, в том числе производимое путем кэширования, кадрирования
					или использованием аналогичных средств, строго запрещается без
					предварительного письменного разрешения AvtoLike. За нарушение
					настоящего правила наступает ответственность, предусмотренная нормами
					гражданского, административного и уголовного законодательства
					Российской Федерации, а также нормами международного права по охране
					интеллектуальной собственности.
				</Typography>
				<Stack>
					<Typography>
						7. Ни при каких обстоятельствах AvtoLike не несет ответственности за
						любую потерю, расходы, убытки или ущерб, (потеря деловых доходов,
						потеря прибыли или любой прямой, косвенный, последующий, специальный
						или подобный ущерб вообще), являющийся результатом:
					</Typography>
					<Typography>
						7.1. Любой погрешности, содержащейся в информации, её неполноты,
						задержки, прерывания в получении, ошибки или упущений в поставке;
					</Typography>
					<Typography>7.2. Любого сбоя информационной системы;</Typography>
					<Typography>
						7.3. Любого решения или действия, сделанного в уверенности
						относительно улучшений в корректности или предоставлении информации.
					</Typography>
				</Stack>
				<Typography>
					8. AvtoLike не несет ответственность за ущерб, причиненный Вашему
					компьютеру, программному обеспечению, модему, телефону и другой
					собственности, который стал результатом использования информации,
					программного обеспечения или услуг портала AvtoLike.
				</Typography>
				<Typography>
					9. При размещении информации пользователем на портале AvtoLike, не
					допускается размещение или передача любой информации, которая нарушает
					или может нарушать авторские и смежные права третьих лиц, носить
					угрожающий характер, быть ложной, обманчивой, подстрекательской,
					клеветнической, нарушающей конфиденциальность, нецензурной,
					порнографической, оскорбительной, дискриминационной, противозаконной
					или любой другой информации, которая может составлять или приводить к
					действиям, которые могут рассматриваться как уголовно наказуемые,
					нарушающие права любой стороны или которые могут иным способом служить
					источником уголовно-правовой ответственности или нарушать какой-либо
					другой закон. За нарушение настоящего правила наступает
					ответственность, предусмотренная нормами гражданского,
					административного и уголовного законодательства Российской Федерации,
					а также нормами международного права по охране интеллектуальной
					собственности.
				</Typography>
				<Typography>
					10. Запрещается использовать портал AvtoLike для рекламы или
					осуществления каких-либо действий коммерческого характера, в том числе
					для навязывания услуг или распространения новостей, за исключением
					мест, сервисов и административных регламентов, специально
					предназначенных для этого.
				</Typography>
				<Typography>
					11. Администрация портала AvtoLike оставляет за собой право на
					изменение информации на данном сайте без предупреждения. Также
					Администрация портала AvtoLike сохраняет за собой право блокировать
					или удалять по своему собственному усмотрению любые объявления,
					сообщения или материалы, которые по ее мнению не соответствуют
					настоящим Правилам или являются неприемлемыми в иных других отношениях
					для AvtoLike. Администрация портала AvtoLike не несёт ответственности
					за несоблюдение пользователями портала настоящих Правил.
				</Typography>
				<Typography>
					12. AvtoLike сохраняет за собой право по своему собственному
					усмотрению изменять и/или модифицировать настоящие Правила в любое
					время. Непрерывное использование портала AvtoLike после внесения
					изменений к настоящих Правилах (включая политику AvtoLike в отношении
					защиты конфиденциальности частной информации) будет означать, что Вы
					принимаете данные изменения.
				</Typography>
				<Typography>
					13. Запрещается несанкционированная регистрация нескольких аккаунтов
					(личных кабинетов) одним пользователем. При регистрации личного
					кабинета контактная информация о владельце личного кабинета должна
					соответствовать действительности. Личный кабинет, используемый для
					подачи объявлений от имени юридического лица, должен быть
					зарегистрирован на юридическое лицо, а не на имя руководителя или
					иного физического лица. При отказе в публикации объявления или в
					предоставлении доступа к интернет-ресурсу, претензии к администрации
					ресурса принимаются только от лица (физического или юридического), на
					имя которого зарегистрирован личный кабинет. Нарушение правил о
					регистрации личного кабинета, используемого для подачи объявлений,
					либо публикация недостоверных и/или недобросовестных объявлений влечет
					прекращение доступа к интернет-ресурсу (блокирование
					аккаунта/аккаунтов), а также удаление всех объявлений.
				</Typography>
				<Typography></Typography>
			</Stack>
		</Container>
	)
}

export default Policy
