import { Container, Stack, Typography } from "@mui/material"
import React from "react"
import Footer from "../../Home/MainHome/Footer"

const Agreement = () => {
	return (
		<Stack
			justifyContent={"space-between"}
			sx={{ minHeight: "calc(100vh - 210px)" }}
		>
			<Container>
				<Stack spacing={1}>
					<Typography variant="h5">Пользовательское соглашение</Typography>

					<Typography>
						1. Данное соглашение регулирует взаимоотношения, возникающие между
						Пользователем (клиентом, использующим функциональные возможности
						сайта и приложения) и владельцами сайта «AvtoLike — цены на машины»
						(в дальнейшем – сайт и приложения «AvtoLike.kz»).{" "}
					</Typography>
					<Typography>
						2. Любое действие по использованию функциональных возможностей сайта
						и приложения AvtoLike.kz, является безоговорочным принятием условий
						настоящего Пользовательского соглашения. Использование возможностей
						сайта способами, противоречащими данному соглашению возможно только
						с письменного согласия владельцев сайта.{" "}
					</Typography>
					<Typography>
						3. Пользовательское соглашение вступает в силу с момента начала
						пользования Пользователем сайта и приложения AvtoLike.kz, и является
						бессрочным. Владельцы сайта вправе изменить данное пользовательское
						соглашение, не уведомляя об этом Пользователя. Новое
						Пользовательское соглашение вступает в силу с момента его публикации
						на AvtoLike.kz. Использование сайта после опубликования нового
						пользовательского соглашения означает согласие Пользователя с
						условиями соглашения.{" "}
					</Typography>
					<Typography>
						4. Информация, содержащаяся в объявлениях, опубликованных
						Пользователем на сайте AvtoLike.kz является общедоступной. Владельцы
						сайта не несут ответственности по обеспечению конфиденциальности в
						отношении данной информации.{" "}
					</Typography>
					<Typography>
						5. При регистрации на сайте Пользователь заполняет учетные данные.
						Пользователь обязуется предоставлять достоверные Сведения и несет
						ответственность за предоставленную им информацию. Пользователь
						добровольно принимает решение о предоставлении AvtoLike.kz своих
						персональных и иных данных (фамилия, имя, отчество, адрес
						электронной почты, номер мобильного телефона, и другой информации)
						для целей исполнения Пользовательского соглашения, а также настоящим
						заявляет о своем согласии на обработку AvtoLike.kz, и его
						аффилированными лицами персональных и иных данных Пользователя, их
						передачу (обеспечивающих адекватную защиту прав субъектов
						персональных данных) для обработки другим Пользователям и/или
						третьим лицам, действующим по поручению AvtoLike.kz, в том числе для
						целей: предоставления консультационной поддержки Пользователям,
						проверки Объявлений и Сведений на предмет соответствия
						Пользовательскому соглашению, доставки сообщений другим
						Пользователям, получения статистических и аналитических данных для
						улучшения функционирования AvtoLike.kz, расширения спектра
						оказываемых Сервисов, получения информационных и/или рекламных
						сообщений AvtoLike.kz или третьих лиц, предупреждения или пресечения
						незаконных и/или несанкционированных действий Пользователей или
						третьих лиц, обеспечения соблюдения требований действующего
						законодательства Республики Казахстан. AvtoLike.kz принимает все
						необходимые меры для защиты персональных данных Пользователя от
						несанкционированного доступа третьих лиц. Пользователь несет полную
						личную ответственность за сохранение в тайне своих учетных данных и
						пароля для доступа на сайт.
					</Typography>

					<Typography>
						6. Размещая информацию на сайте AvtoLike.kz, Пользователь понимает и
						принимает на себя все риски, связанные с размещением информации, в
						том числе: риск попадания адреса электронной почты в списки для
						рассылки спам-сообщений, риск попадания адреса электронной почты к
						различного рода мошенникам, риск попадания телефонного номера к
						SMS-спамерам и/или SMS-мошенникам и иные риски, вытекающие из такого
						размещения информации. Пользователь соглашается на получение
						электронных писем (e-mail) и сообщении на указанные им при
						регистрации адреса электронной почты или номер телефона, от
						владельцев сайта AvtoLike.kz, которые могут содержать как
						информационный, так и рекламный характер. Владельцы сайта не
						отвечают за достоверность указанной в учетных данных пользователя
						информации.
					</Typography>
					<Typography>
						7. Пользователь берет на себя ответственность за достоверность и
						полноту информации, указанной им в подаваемых на сайте объявлениях.
					</Typography>
					<Typography>
						8. На сайте запрещена публикация объявлений содержание которых
						нарушает действующее законодательство или не соответствует правилам
						AvtoLike.kz.
					</Typography>
					<Typography>
						9. Пользователь берет на себя обязанность по проверке информации
						содержащейся в его объявлении на предмет противоречия его
						действующему законодательству. Владельцы сайта не отвечают за
						достоверность указанной объявлениях пользователя информации.
					</Typography>
					<Typography>
						10. Владельцы сайта не являются стороной, участвующей в совершаемой
						(совершенной) с помощью сайта AvtoLike.kz сделки. Пользователи
						заключают сделку напрямую.{" "}
					</Typography>
					<Typography>
						11. Пользователь берет на себя обязательства действовать в
						соответствии с действующим законодательством РК и Пользовательским
						соглашением AvtoLike.kz, а также несет в соответствии с
						законодательством полную ответственность за собственные действия и
						бездействие, связанные с использованием возможностей сайта.{" "}
					</Typography>
					<Typography>
						12. В случае возникновения судебной и/или спорной ситуации, когда у
						одного Пользователя возникают претензии к другому Пользователю
						связанные с пользованием сайта, Пользователь берет на себя
						обязательства предъявлять требования и разрешать претензии
						самостоятельно и без участия владельцев сайта AvtoLike.kz.{" "}
					</Typography>
					<Typography>
						13. Владельцы сайта не несут ответственности за ущерб или расходы,
						возникшие в связи с использованием или невозможностью использования
						сайта AvtoLike.kz.{" "}
					</Typography>
					<Typography>
						14. Владельцы сайта имеют право на редактирование, удаление,
						блокировку, отклонение либо возврат объявления пользователю для
						доработки, а также на перенос объявления в другой раздел доски
						объявления в целях удобства посетителей сайта.
					</Typography>
					<Typography>
						15. Владельцы сайта имеют право на продление, завершение и перенос
						сроков публикации объявления без объяснения причин.
					</Typography>
					<Typography>
						16. Владельцы сайта имеют право на определение способов и условий
						отображения объявления Пользователя на сайте.
					</Typography>
					<Typography>
						17. Публикация объявления на сайте означает согласие Пользователя с
						правых владельцев сайта на нанесение фирменного логотипа сайта на
						фотографии, используемые Пользователем в объявлениях.
					</Typography>
					<Typography>
						18. Владельцы сайта не гарантируют непрерывной, надежной и
						безошибочной работы как всего сайта AvtoLike.kz так и части его
						сервисов.
					</Typography>
					<Typography>
						19. Владельцы сайта вправе прекратить или приостановить доступ
						Пользователя к сервисам или полностью к сайту AvtoLike.kz, в случае
						нарушения Пользователем правил пользования сайтом.
					</Typography>
					<Typography>
						20. Пользователь не возражает против получения рекламной информации,
						размещенной на сайте третьими лицами.
					</Typography>
					<Typography>
						21. Владельцы сайта не отвечают за содержание и достоверность
						рекламной информации, размещенной на сайте Пользователями и
						рекламодателями.
					</Typography>
					<Typography>
						22. Владельцы сайта вправе, передавать свои права и/или обязанности
						по настоящему Пользовательскому соглашению как в целом, так и в
						части, третьей стороне. В случае передачи прав и/или обязанностей
						как в целом, так и в части, владельцы сайта обязуются сообщить
						Пользователям, кому были переданы права и/или обязанности по
						настоящему Пользовательскому соглашению, как в целом, так и в части,
						путем публикации соответствующей информации на AvtoLike.kz. В случае
						передачи прав и/или обязанностей как в целом, так и в части по
						настоящему Пользовательскому соглашению третьей стороне, третья
						сторона имеет право предоставлять аналогичные или похожие услуги на
						другом сайте.{" "}
					</Typography>
					<Typography>
						22. Операции по платежным картам совершаются держателем карты. Во
						избежание случаев различного рода неправомерного использования
						платежных карт при оплате, все Заказы, оформленные на Сайте и
						предоплаченные платежной картой, проверяются Компанией. В случае
						выявления нарушений использования платежных карт, а равно получения
						информации и совершении мошеннических действий с платежными картами
						Владельцы сайта оставляет за собой право без объяснения причины
						аннулировать объявления.
					</Typography>
					<Typography>
						23. При разрешении всех споров, возникших по Пользовательскому
						соглашению стороны, обязуются применять действующее
						законодательство.
					</Typography>
				</Stack>
			</Container>
			<Stack pt={5}>
				<Footer />
			</Stack>
		</Stack>
	)
}

export default Agreement
